app/views/contacts/_box.html.erb

SELECT "cabinets".* FROM "cabinets" WHERE "cabinets"."id" = ? LIMIT 1  [["id", 1]]
---
  <b>Cabinet:</b>
  <%= Cabinet.find(@contact.cabinet_id).name unless @contact.cabinet_id.nil?  %>