app/controllers/cabinets_controller.rb

SELECT `cabinets`.* FROM `cabinets`
---
  def index

    @cabinets = Cabinet.all

SELECT "cabinets".* FROM "cabinets" WHERE "cabinets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @cabinet = Cabinet.find(params[:id])

SELECT "cabinets".* FROM "cabinets" WHERE "cabinets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @cabinet = Cabinet.find(params[:id])

INSERT INTO `cabinets` (`cabinet_url`, `created_at`, `creation_date`, `description`, `facebook`, `linkedin`, `logo_content_type`, `logo_file_name`, `logo_file_size`, `logo_updated_at`, `name`, `rating`, `siret`, `statut`, `twitter`, `updated_at`) VALUES ('http://www.ecdys.com', '2011-07-21 10:09:44', '2011-07-21', 'ECDYS est une structure de conseil de direction générale, fondée en juin 2009, autour d’une équipe de 20 consultants, riche de la diversité de leur trajectoire et de leur savoir-faire. Notre ambition est d’être reconnu comme un cabinet de référence dans l’amélioration des performances opérationnelles.\r\n\r\nECDYS a pour racine un mot grec ancien ἔκδυσις qui signifie la mutation.\r\n\r\nEcouter\r\n\r\nNous intégrons toutes les dimensions d’une situation.\r\nNous veillons à ce que s’expriment tous les talents.\r\nCréer\r\n\r\nNous donnons vie à vos idées.\r\nPour vous, nous concevons une démarche « sur-mesure ».\r\nDynamiser\r\n\r\nNous nous intégrons à vos équipes pour accélérer les mutations.\r\nNous atteignons ensemble des résultats concrets et pérennes.\r\nSimplifier\r\n\r\nDe la vision aux résultats, avec vous, nous tenons le cap.\r\nNous avons le souci de la simplicité et de l’efficacité.', '', '', 'image/png', 'logo_fond_clair.png', 14231, '2011-07-21 10:09:44', 'ECDYS', 5, '1234', 'SAS', 'ecdysconsulting', '2011-07-21 10:09:44')
UPDATE "users" SET "cabinet_id" = NULL, "updated_at" = '2011-07-18 09:46:53.329270' WHERE "users"."id" = 1
---
  def create
    @cabinet = Cabinet.new(params[:cabinet])


    respond_to do |format|
      if @cabinet.save
        current_user.cabinet_id = @cabinet.id
        current_user.save

SELECT "cabinets".* FROM "cabinets" WHERE "cabinets"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "cabinets" SET "cabinet_url" = 'www.bios-group.com', "twitter" = 'lfrileux', "updated_at" = '2011-07-12 14:59:54.580319' WHERE "cabinets"."id" = 2
---
  def update
    @cabinet = Cabinet.find(params[:id])

    respond_to do |format|
      if @cabinet.update_attributes(params[:cabinet])

SELECT "cabinets".* FROM "cabinets" WHERE "cabinets"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "cabinets" WHERE "cabinets"."id" = ?  [["id", 3]]
---
  def destroy
    @cabinet = Cabinet.find(params[:id])
    @cabinet.destroy