app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save
---
INSERT INTO `contacts` (`cabinet_id`, `created_at`, `email`, `facebook`, `fonction`, `linkedin`, `mobile_phone`, `nom`, `parcours`, `phone`, `photo_content_type`, `photo_file_name`, `photo_file_size`, `photo_updated_at`, `prenom`, `twitter`, `updated_at`, `viadeo`) VALUES (1, '2011-07-21 10:10:48', '', '', 'Président', '', '06 86 37 45 18', 'Leroy', '', '01 44 01 66 36', NULL, NULL, NULL, NULL, 'Hervé', '', '2011-07-21 10:10:48', '')

  def update
    @contact = Contact.find(params[:id])

    respond_to do |format|
      if @contact.update_attributes(params[:contact])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "contacts" SET "prenom" = 'Denis', "nom" = 'Lemoine', "photo_file_name" = 'img004.jpg', "photo_content_type" = 'image/jpeg', "photo_file_size" = 64851, "photo_updated_at" = '2011-07-11 16:58:12.235529', "fonction" = 'Directeur Associé', "updated_at" = '2011-07-11 16:58:12.244480' WHERE "contacts"."id" = 4