app/controllers/implantations_controller.rb

SELECT "implantations".* FROM "implantations"
---
  def index
    @implantations = Implantation.all

SELECT *, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((48.8611 - latitude) * PI() / 180 / 2), 2) + COS(48.8611 * PI() / 180) * COS(latitude * PI() / 180) * POWER(SIN((2.34425 - longitude) * PI() / 180 / 2), 2) )) AS distance, CAST(DEGREES(ATAN2( RADIANS(longitude - 2.34425), RADIANS(latitude - 48.8611))) + 360 AS decimal) % 360 AS bearing FROM `implantations` WHERE (latitude BETWEEN 48.71636821688915 AND 49.00583178311085 AND longitude BETWEEN 2.1242550066802797 AND 2.5642449933197207 AND implantations.id != 1) GROUP BY implantations.id,implantations.address,implantations.latitude,implantations.longitude,implantations.created_at,implantations.updated_at,implantations.site,implantations.cabinet_id HAVING 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((48.8611 - latitude) * PI() / 180 / 2), 2) + COS(48.8611 * PI() / 180) * COS(latitude * PI() / 180) * POWER(SIN((2.34425 - longitude) * PI() / 180 / 2), 2) )) <= 10 ORDER BY 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((48.8611 - latitude) * PI() / 180 / 2), 2) + COS(48.8611 * PI() / 180) * COS(latitude * PI() / 180) * POWER(SIN((2.34425 - longitude) * PI() / 180 / 2), 2) )) ASC
---
  def show
    @implantation = Implantation.find(params[:id])

INSERT INTO `implantations` (`address`, `cabinet_id`, `created_at`, `latitude`, `longitude`, `site`, `updated_at`) VALUES ('71 rue saint-honoré 75001 Paris', 2, '2011-07-21 10:14:08', 48.8611047, 2.3442463, 'Siège social', '2011-07-21 10:14:08')
---
  def create
    @implantation = Implantation.new(params[:implantation])
    if @implantation.save

SELECT "implantations".* FROM "implantations" WHERE "implantations"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @implantation = Implantation.find(params[:id])

SELECT "implantations".* FROM "implantations" WHERE "implantations"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "implantations" SET "address" = '10 rue des tournelles, chatenay-malabry', "latitude" = 48.7695075, "longitude" = 2.2824193, "updated_at" = '2011-07-11 20:16:20.739918' WHERE "implantations"."id" = 2
---
  def update
    @implantation = Implantation.find(params[:id])
    if @implantation.update_attributes(params[:implantation])

SELECT "implantations".* FROM "implantations" WHERE "implantations"."id" = ? LIMIT 1  [["id", "10"]]
DELETE FROM "implantations" WHERE "implantations"."id" = ?  [["id", 10]]
---
  def destroy
    @implantation = Implantation.find(params[:id])
    @implantation.destroy