app/controllers/testimonials_controller.rb

SELECT "testimonials".* FROM "testimonials"
---
  def index
    @testimonials = Testimonial.all

SELECT "testimonials".* FROM "testimonials" WHERE "testimonials"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @testimonial = Testimonial.find(params[:id])

SELECT "testimonials".* FROM "testimonials" WHERE "testimonials"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @testimonial = Testimonial.find(params[:id])

INSERT INTO "testimonials" ("cabinet_id", "citation", "client_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cabinet_id", 1], ["citation", "Ils sont géniaux !"], ["client_name", "Safran"], ["created_at", Tue, 12 Jul 2011 21:43:20 CEST +02:00], ["updated_at", Tue, 12 Jul 2011 21:43:20 CEST +02:00]]
---
  def create
    @testimonial = Testimonial.new(params[:testimonial])

    respond_to do |format|
      if @testimonial.save

SELECT "testimonials".* FROM "testimonials" WHERE "testimonials"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "testimonials" SET "client_prenom" = 'Christian', "client_nom" = 'Picollet', "updated_at" = '2011-07-12 20:20:13.026692' WHERE "testimonials"."id" = 3
---
  def update
    @testimonial = Testimonial.find(params[:id])

    respond_to do |format|
      if @testimonial.update_attributes(params[:testimonial])

SELECT "testimonials".* FROM "testimonials" WHERE "testimonials"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "testimonials" WHERE "testimonials"."id" = ?  [["id", 1]]
---
  def destroy
    @testimonial = Testimonial.find(params[:id])
    @testimonial.destroy